<?php
    $a = 5;                      // $a에 5를 저장하면
    print $a . "<br/>";     // 변수값 5가 출력된다.
   
    print "<hr/>";
   
    $a += 3;                    // $a값 5에 3을 더한 결과갑 8을 다시 $a에 저장하면
    print $a . "<br/>";     // 변수값 8이 출력된다.
   
    print "<hr/>";
   
    $a -= 4;                    // $a값 8에 4를 뺀 결과갑 4를 다시 $a에 저장하면
    print $a . "<br/>";     // 변수값 4이 출력된다.
   
    print "<hr/>";
   
    $a *= 2;                    // $a값 4에 2를 곱한 결과갑 8를 다시 $a에 저장하면
    print $a . "<br/>";     // 변수값 8이 출력된다.
   
    print "<hr/>";
   
    $a /= 4;                    // $a값 8을 4로 나눈 결과값 2를 다시 $a에 저장하면
    print $a . "<br/>";     // 변수값 2이 출력된다.
   
    print "<hr/>";
   
    $a %= 2;                   // $a값 2를 2로 나눈 나머지 0을 다시 $a에 저장하면
    print $a . "<br/>";     // 변수값 0이 출력된다.
?>

